#include <iostream>
using namespace std;
int menu() //主菜单
{
    int choice;
    cout << "|--------------------------图书管理系统-----------------------------|" << endl;
    cout << "|--------------------------1----用户注册----------------------------|" << endl;
    cout << "|--------------------------2----管理员注册--------------------------|" << endl;
    cout << "|--------------------------3----用户登陆----------------------------|" << endl;
    cout << "|--------------------------4----管理员登陆--------------------------|" << endl;
    cout << "|--------------------------5----退出--------------------------------|" << endl;
    cin >> choice;
    return choice;
}
int reader_menu() //用户菜单
{
    int choice;
    cout << "-----------1-查看图书-------" << endl;
    cout << "-----------2-借书-----------" << endl;
    cout << "-----------3-还书-----------" << endl;
    cout << "-----------4-退出-----------" << endl;
    cin >> choice;
    return choice;
}
int lib_menu() //管理员菜单
{
    int choice;
    cout << "-----------1增加图书-------" << endl;
    cout << "-----------2删除图书-------" << endl;
    cout << "-----------3修改图书-------" << endl;
    cout << "-----------4查询图书-------" << endl;
    cout << "-----------5退出-----------" << endl;
    cin >> choice;
    return choice;
}